{
    "title": "CyberMod changelog",
    "tag": "changelog",
    "section":

    [
		"UPDATE NATIVE SETTING FIRST !!!",
        "CyberMod 1.1.0: Fundation update \n\nHere we are. An new version that officially support 1.5 ! \nThis version is called Fundation update.\nWe do an lot of optimization and redo an lot of code to provide an better, stronger and robust mod.\n\nWith this, Cybermod now enter in an advanced state, means it had enought features to be cool and we will start to create more content and scripts.\n\nThe editor reach an new step and is now more accessible and user friendly than before. I hope you can start to create and share great stories with it !\n\nThis update also provide an new multiplayer experience, who will continue to evolve in future. I hope you will like it.\n\n\nFor all details, you can view the wiki (link in discord and nexus) who is your new reference for the mod usages and features :)\n\n\n\nAs always, I (donk7413) want to thanks the teams (Redrock Studio) for the help, the time and the patience they have for debug, find and improve the mod.\nI want to thanks Patreons user for the support and for try the beta, your help was an great thing !\nAlso Discord community and users, who support us and always be good toward our moves and support us :D\nOther modders that help me, by answering, sharing or suggesting.(special thanks to craze for the code review and the new datapack engine)",
        "Complete changelog\nFix :\n- NPC spawned by mod can be invincible since 1.5\n- Display custom mappin on map\n- Gang territory doesn't show on map\n- Lot of others bugs\n\nGameplay : \n- Adapt mod to 1.5 (map, gang, apartment, code...)\n- Improve Point Of Interest support\n- You can buy custom place in EzEstates tab on PC, check cybermod estates menu (native support of custom place)",
        "Multiplayer : \n-Improved Sync between player and support vehicule skin\n-Added player nickname display when you target one\n-Added Mulitplayer Datapack (Joytoy RP, more to come)\n\n-Added Instance \n-Added Instance User List\n-Added Instance Management for the owner\n-Added Instance Multiplayer Housing (you can build together !)\n-Added RolePlay Instance \n\n-Added Guild\n-Added Guild Territory System\n-Added Guild showing on map instead of gang if online\n\n-Added FriendList (you can manage it)\n-Added Phone Messages to instance\n-Added Whisper Message (subtitle) to player\n-Added Shootout Message (subtitle over head) to player around you",
        "Editor \n- Added Editor Tutorial tabs\n- Added JSON viewer (you can switch between Json and editor)\n- Rework UI for Spawn NPC / Spawn Car / Set Mappin\n- Rework some other UI components\n- Added new items in Editor\n- Added Housing tabs\n- Added Editor Setting Tab (for test an script step by step and change the camera)",
        "Technical :\n-New HUD\n-Updated external psiberx library to latest version\n-Added server score support (trigger and action)\n-Added player server score support(trigger and action)\n-Clean the code and optimizing it\n-Optimize the code (thanks craze)\n-Added Multiplayer State in native UI\n-Added Faction Rival State in native UI\n-Improved Spawn for NPC and vehicule\n-Added bunch of new actions and trigger (more than 100+)\n-New datapack loading system, faster and proper (thanks craze for the idea :) )\n-Added Timer as native UI \n-Added Faction Relation system, trigger and action \n-Added Faction Relation support in Editor\n-Added Font and Background Color Support for Interface\n-Added Font and Background Color Support for Interface in Editor\n-Better script logs error\n-Added support of many notifications : Incoming Call,Quest, Shard, New Contact, Location, Activity, Hacking, Tutorial\n-Phone notification can now load an custom Phone Thread popup where you can interact in it\n-Shard notification can now load an custom shard popup where you can interact in it\n-Help item is now supported in native way\n-Added new settings for manage compiled datapack cache and UI",
        "Script System Engine:\n\nNew actions : \n-spawn_npc\n-set_mappin\n-spawn_vehicule_v2\n-change_vehicle_skin\n-incoming_call\n-set_player_current_gang\n-set_gang_relation\n-add_gang_relation\n-show_texture (support PNG, JPG, BMP image)\n-hide_texture\n-execute_at_script_level\n-execute_at_script_level_group\n-set_script_level\n-set_script_level_group\n-quest_notification\n-shard_notification\n-contact_notification\n-location_notification\n-activity_notification\n-hacking_notification\n-open_tutorial\n-start_effect\n-stop_effect\n-open_help\n\nNew triggers : \n-player_current_gang\n-entity_is_in_custom_place_type\n-entity_is_in_custom_room_type\n-check_gang_relation\n-texture_is_visible\n-entity_script_level\n-group_script_level",
		
		"",
		
		"CyberMod 1.0.0\n\nAn brand new name and logo for an brand new adventure.\n\nWhy ? Because things have changed so deeply that it appears to us that IRP must die for CyberMod (CM).\n\nThis release have been so far the most important of the mod. \n\nIt changes everything and eveything is easier (or not :P ).\n\n\nFirst at all, take an look in your shard menu, and read the credit.\nAll of the guys inside, thanks you !",
		"Now what changes : \n\n\n- Native Custom Quest :\nGo to see an fixer. When you are near from it, open your quest journal menu.\nYou should see it into NCPD Missions (or maybe in some other category depending of the datapack).\nTrack the mission and follow the instruction at screen. That's all :)\n\n- Native Custom dialog :\nYou can navigate through like game dialog (up and down) then F(or X) for valid.\nnow with branching options.\n\n- Native Custom subtitles support in scripting \n\n- Native Custom chatters support in scripting \n\n- Native Custom interact : \nNow you have an special interact for open an UI that will ask you which group you want to display. \nAlso lot of hotkey have been added and let you make shortcut for interact for your favorite datapack.\nFor gamepad : short left DPad press will popup the interacts and cycle through, long press will hide it.\n\n- Native Custom Shard support for scripting\n\n- Native Custom Phone Contact support for scripting\n\n- Native Custom Phone texting support for scripting, with branching option\n\n- Native Custom Menu and UI support for scripting\n\n- Native Custom Radio for scripting, with your music.",
		"- Territory Wars : \nMap show District and Subdistrict's gang leader. \nThis can change depending of missions that you do for gangs or corpos. \nMeans you can make one gang that rules all Night City\n\n- Custom place are now tagged on map.\n\n- No need of SoundManager\n\n- Custom Native Garage: \nYou can unlock some special vehicles like AV or Police, then call it directly from garage interfaces.\n\n- Native Housing : \nGo to an custom place that can be bought.\nChoose Housing datapack interact group.\nBuy this house.\nNow go to keystone, Item Market tabs.\nAdd several items in your cart and buy it.\nOpen the Buyed Items Popup, select one you want place.\nThe item will pop and follow your visor. \nUse place it interact for place it where you want.\n\nWarning : some items can be placed like this, for theses ones, you will have XYZ YawPitchRoll Interacts.\n\n",
		"- Corpo Wars and Online functionnalities: \n\nThat's an huge feature. Let's describe it !\n\nFirst you need make an account in our server to login and download contents like datapack or items.\nChoose an Faction. Nomad is special, they work for the looser of between Arasaka, Militech and Kangtao.\n\nIn your faction, you will have an rank. \n\nMore you do missions related to your faction, more your rank go high.\n\nWhen you complete an Corpo Missions, depending of your rank, you will earn points for your faction's market stock.\n\nYou can buy and sold theses shares for make money.\n\nAlso , more your faction is powerful, more they can buy sub Corpo. Some upcoming contents will be related to it.\n\nThe winner is the corpo who is 1st at end of the month. then you will have reward (starting it in January)\n\nYou can see the corpos event in Corpo News Tab on Keystone.",
		"Datapack :\n\nMissions of Night City :\nAlmost 4000 new missions throught fixers and gangs.\n\nArasaka, Militech, KangTao and Nomad special Corpo Mission, part of corpo wars.\n\nAV of Night City : \nBuy an AV and add it to your garage, you can drive and fly with it :)\n\nPlaces of Night City : \nadded more than 30+ new custom places. With housing options and stuff.\n\nRelations of Night City: \nRevamped Relations with an npc, got to bar, take an beer or talk with them to gain affinity and make them your followers (or more <3)\n\nJoytoy of Night City : \nbecome an Joytoy and take client. Depending of your choices you can be dirty and win money but you will have some malus. Or stay clean but you will have less money.\n\nMetro of Night city : \nIt's here ! an fully functionnal Metro. Check your map, you will see Metro's Station. Go to it, lookat the door and choose an destination from available interact. Tehn look at the remaning time and enjoy the trip !\n\nGang Wars of Night City : \nrandom events that can influencate the gang territory wars.\n\nGangs of Night city : \n\nDangers of Night City : \nIn Depth Ambush System. Expect to see Trauma Team and help them. Or Maxtax VS Gang or also Gang VS Gang. and why not Gang VS you !\n\nMusic : \nAkira : \nwill play Kaneda theme when you ride with Akira's bike.\n\nBack to the Future Theme : \nwill play BTTF theme when you drive modded caliburn with av toggle;\n",
		"So now let's talk about UI and the biggest criticism of the mod : CET UI.\n\nNow there is only 3 CET windows : \n\n\n\nKeystone : Online functionnalities need text input that are not supported natively in game.\n\nEditor : who let you make your own script.\n\nTools : for setting up the mod and datapack manager.",
		"That's make 90 % of the mod native. And that's the true feature of the update. \n\n\nI want thanks all of the team and people who make this possible (read the credits !!). \n\nWe hope you will enjoy CyberMod because we put love and coookies in it :)"
		
	
	
	
	
	
	
	
	
	
	]

}
