{
    "version": "1.1.17",
    "channel": "stable",
    "changelog": "1.1.17 : Fix :\n - Fix some framework crash \n1.1.16 : Fix :\n Fixed Datapack Download and update  \n1.1.15 : Fix : \nMods : \n -AMM API compatibility \n- Framework Closes when the Player Tries to Update a Datapack, Or joins an Multiplayer instance then tries to join another instance. Any type of Online activity has a chance to close the framework window.\n\n- VIP Entities can't spawn at all, LOG: scripting.lua 2273 error points to that line. \n\n- The Refreshing of the Cache every time the player pauses the game , Or goes into Inventory, Makes all Gangs of Night City NPCs start to respawn Behind the player. => added an setting for disable it\n\n- Settings in Cybermod settings Don't save: Ambush mode, and Turn off Cybermod HUD settings do Not Save. \n\n- Clean the mess Action doesn't despawn an entity after looking away any more . \n\n- ANY ACTION That can use Current_district_leader as a string, Produces an error to identify that element.\n\n\n\nEditor :  \n\n-Can't Access already Made POIs anymore so The player can't load in POIs into editor.  \n\n- Can't Build Datapack when selecting the Tab build a datapack \n\n-NPC: who speak has Blank entries when using the fixer way. and only wakako shows as the option. 1.1.14\n\n-small fixes\n\n1.1.13\n\n-Added last killed Entity trigger and action\n\n1.1.12\n\nEditor : \n- Path UI reworked\n- Several Bugfix\n- Do_function and do_random_function can now apply the targeted function to a tag. Means we can do generic function that can be reused.\n- Do_function ,do_random_function, Do_event and do_random_event can now run the targeted script in parallel from parent script (so the parent doesn't wait the end of the execution of the script for continue)  \n1.1.11\nEditor : \n- added support for free cam and industrial camera in editor setting\n- Edited UI for path \n- Path can now be relative\nAn path location can now support an list of action that will play right after this location.\n\nActions : \n- removeEffect_entity and applyEffect_entity changes to remove_effect and apply_effect. It now accept more effect in value.\n- Added Set Fact\n- Play_path and group_play_path (don't need an node to play an path !)\n\n\n\n\nTriggers :\n- Added check_score trigger\n- Added last_killed_entity_is_registred trigger\n- Added last_killed_entity_is trigger\n- Added last_killed_entity_is_in_gang trigger\n- Added last_killed_entity_is_in_specific_gang trigger\n- Added last_killed_entity_gang_score trigger\n\n\nFix : \n-Phone dialog support now lang file\n-Compiler will now handle an datapack without desc.json as an error\n-Path is now better, faster and stronger\n\n\n\n\nAMM Collab (Big thanks to MaximiliumM !) : \n- Initial Support of upcoming AMM version API and specific datapack using AMM content. It will be enabled as soon that AMM release it through an small update ^^\n- Added Songbird from AMM as Avatar for MP but also as Entity for Script (you need AMM mod for see and use her)\n- Some datapacks will now require AMM for be seen and works. \n- Added AMM props in Keystone Market under AMM category, you can use it in solo or MP for building (only user who have AMM will see them) :)\n\nThese collab means that you can use custom props and appearance from AMM. Amm props will be added on keystone market under AMM category and supported in housing (Solo or MP).\nWe hope that this collab can unlock an lot of possibilities about stories and event ^^1.1.10 \n + Better Datapack compiler error handling\n+ An corrupted datapack will not be included in compiler, but the compiler will continue to check the others instead of stop all imports.\n+ Fix bug about UI when downloading or updating an datapack will not refresh it in keystone.\n+ Password input can now be hidden (for streaming)\n+ Fixed an bug about init Script that doesn't run again after an save loading\n+ Added better gang affinity calculator (in case that the save doesn't have cybermod session data bounded) \n+ Added Recalculate All Affinity (Gang and NPC) and Clear All Affinity (Gang and NPC) in mod setting\n- Removed Reset All Affinity (Gang and NPC) button in mod setting\n+ Ambush doesn't take one random event anymore, it will play every possible event. The randomness must be now handled in script directly.\n+ Fix Bug about player current gang trigger\n+ Fix Ambush Timer and ambush trigerring\n+ Added trigger : \n> datapack_is_enabled\n> datapack_version \n 1.1.9 fix potential issue with tutorial \n 1.1.8 - QOL fixes \\n1.1.7 - Rewrite dialog system (look like one in game now and clearly more organic)\n- Better NPC invite script\n- Optimizing Framework \\n 1.1.6 -Hotfix : Fix script error about clean custom mappin\n1.1.5 - - Added Downloaded Datapack Menu in Keystone\n- Fix scripting issue with custom place mappin on map\n- Fix bug about AV speed doesn't show\n- Fix Editor UI bugs (POI, Scene, Datapack Builder)\n- Fix critical bug that break mod when using AV\n\n1.1.4 - remove the user disconnect at shutdown \n1.1.3 - Better framework connection (less desync) \n 1.1.2 - Fix HUD that doesn't disappear when toggle OFF\n- Fix Custom Radio not playing\n- AV have now an speed based on the real mass of the vehicule (more the vehicule is heavy, slower is the speed)\n- AV Speed is now displayed on HUD when you are in an AV \n- Vehicule that are undriveable can be called as AV\n- Fix 500 and 400 framework error (it can happen but less often)\n- Improve speed of scroll in native UI\n- Added Scene Support in Editor and Script System :) \n 1.1.1\nFix :\n-Fix issue about attitude \n-Fix issue about modpack loading \n1.1.0\nFix :\n- NPC spawned by mod can be invincible since 1.5\n- Display custom mappin on map\n- Gang territory doesn't show on map\n- Lot of others bugs\n\nGameplay : \n- Adapt mod to 1.5 (map, gang, apartment, code...)\n- Improve Point Of Interest support\n- You can buy custom place in EzEstates tab on PC, check cybermod estates menu (native support of custom place)\n\n\nMultiplayer : \n-Improved Sync between player and support vehicule skin\n-Added player nickname display when you target one\n-Added Mulitplayer Datapack (Joytoy RP, more to come)\n\n-Added Instance \n-Added Instance User List\n-Added Instance Management for the owner\n-Added Instance Multiplayer Housing (you can build together !)\n-Added RolePlay Instance \n\n-Added Guild\n-Added Guild Territory System\n-Added Guild showing on map instead of gang if online\n\n-Added FriendList (you can manage it)\n-Added Phone Messages to instance\n-Added Whisper Message (subtitle) to player\n-Added Shootout Message (subtitle over head) to player around you\n\nEditor \n- Added Editor Tutorial tabs\n- Added JSON viewer (you can switch between Json and editor)\n- Rework UI for Spawn NPC / Spawn Car / Set Mappin\n- Rework some other UI components\n- Added new items in Editor\n- Added Housing tabs\n- Added Editor Setting Tab (for test an script step by step and change the camera)\n\n\nTechnical :\n-New HUD\n-Updated external psiberx library to latest version\n-Added server score support (trigger and action)\n-Added player server score support(trigger and action)\n-Clean the code and optimizing it\n-Optimize the code (thanks craze)\n-Added Multiplayer State in native UI\n-Added Faction Rival State in native UI\n-Improved Spawn for NPC and vehicule\n-Added bunch of new actions and trigger (more than 100+)\n-New datapack loading system, faster and proper (thanks craze for the idea :) )\n-Added Timer as native UI \n-Added Faction Relation system, trigger and action \n-Added Faction Relation support in Editor\n-Added Font and Background Color Support for Interface\n-Added Font and Background Color Support for Interface in Editor\n-Better script logs error\n-Added support of many notifications : Incoming Call,Quest, Shard, New Contact, Location, Activity, Hacking, Tutorial\n-Phone notification can now load an custom Phone Thread popup where you can interact in it\n-Shard notification can now load an custom shard popup where you can interact in it\n-Help item is now supported in native way\n-Added new settings for manage compiled datapack cache and UI\n\n\nScript System Engine:\n\nNew actions : \n-spawn_npc\n-set_mappin\n-spawn_vehicule_v2\n-change_vehicle_skin\n-incoming_call\n-set_player_current_gang\n-set_gang_relation\n-add_gang_relation\n-show_texture (support PNG, JPG, BMP image)\n-hide_texture\n-execute_at_script_level\n-execute_at_script_level_group\n-set_script_level\n-set_script_level_group\n-quest_notification\n-shard_notification\n-contact_notification\n-location_notification\n-activity_notification\n-hacking_notification\n-open_tutorial\n-start_effect\n-stop_effect\n-open_help\n\nNew triggers : \n-player_current_gang\n-entity_is_in_custom_place_type\n-entity_is_in_custom_room_type\n-check_gang_relation\n-texture_is_visible\n-entity_script_level\n-group_script_level\n\n\n1.0.24\n Fix bug about playing sound \n1.0.23\n Fix Login edit in Network menu 1.0.22\n fix entrance in some custom place\n1.0.21\n Fix : territory point doesnt load or save. \n Refresh when you download or update datapack \n1.0.20 \n Fix Native Location UI \n 1.0.19 \n Native Location UI (can be enable/disable in setting) \n1.0.18 \n Fixes :Blazing Fast Keystone Loading (5 second now) \n - UI and Framework \n - Added Resfresh Button everywhere :) \n - Merry Christmas 2021 ! \n 1.0.17 \n Fixes : UI and Framework \n 1.0.16 \n Fixes : UI and Framework \n1.0.15 \n Fixes : UI and Framework \n1.0.14 \n Added some script function \n Fix some bug in Framework \n 1.0.12 \n bugfix : \n Fix gang territory affinity that are not loaded if existing sessions \n 1.0.11 \n bugfix : \n native setting crash and don't save your data \n datapack manager \n 1.0.10 \n :Keystone is dead, say hello to Native Keystone ! Go to any custom place that have an PC and you will find an 'CyberMod' Tab, click on it :) \n Login is now automatic at mod launch if you have check remember me in multiplayer menu \n Scroll work with gamepad and can be tweaked in mod setting \n Multiplayer setting are now in mod setting \n You can display XYZ position on Map \n Multiplayer login and register is now in CET CM menu \n Fix : Affinity toward entities from datapack can be enabled/disabled in setting \n Car spawn \n optimization"
}
