{
	"version": "1.1.17",
	"channel": "stable",
	"changelog": "1.2.0 : \n\tNEW NAME and DISCUSSION\n\t-----------------------\n\t\n\t-For a better clarity and understanding about what this Mod is, CyberMod Is Now CyberScript.\n\t\n\t-We think that this New Name is needed and Important because we want the people to know This framework/mod isn't a scam (If you know, you know). Also to better represent the objective of this mod. \n\t\n\t-It's not JUST a \"GangWars, multiplayer, flying vehicle, etc...\" mod.  \n\t\n\t-It's an SCRIPTING FRAMEWORK where we allow you to have \"GangWars, multiplayer, flying vehicle, etc...\" functionnalities, through crafting your own scripts, using the CS Framework. We have been using only the framework's tools to create majority of features you have seen. You can make Incredible things with this Framework. The proof is there.\n\t\n\t- We hear you, The mod is a bit daunting to learn. We did intend for Cyberscript to be used by all, however, to TRULY USE The framework to it's potential, it helps to know or   be Willing enough to script using JSON and the Framework's rules. The end goal for the Framework is for a Vast majority of players to be able to create their own scripted content with many different game elements that are Offered by the Framework. Endless Content, so to speak. We hear you, We will help you learn. :)\n\t\n\t- Lastly, Content wise, There is a good deal of stuff added in the datapacks. The reason we say this is a Big Update is more on the Technical side of this Update. The changes and additions made Set an even more Stronger foundation for newer JSON scripters who want to learn the framework and for Mad men like Eli, who pushes the Framework to new limits never tested. So for Savvy people, or people who have delved into the files of this mod and know how it works, You'll love this update more than the average person. \n\t\n\n\tLANGUAGE:\n\t--------\n\t\n\t- 99% of CyberScript is Now Localized, and Coherent in Native Settings, Keystone, Editor, and some of the NPC star Dialogs.\n\t\n\t- Added extra little tips and hints for various tabs in the Editor. \n\t\n\t- Additionally, Donk made it possible for Other Languages to easily be used if you just change the value of the \"key\":. List of all Transalatable Words can be found in -> quest_mod\\data\\lang. <----\n\t\n\t- Editor Introduction's Text has been Localized to be fully digestable. \n\t\n\t- Native UI Settings now have a bit more Clarity to them, in their wording for the Title of the setting and the description of what the setting does.\n\t\n\n\n\tKEYSTONE:\n\t--------\n\t\n    - Better and faster Keystone Loading.\n\t- Fixed create account issue.\n\t- Fixed Stock Buy/Sell Functionality on Keystone. \n    - Improved scroll speed in Keystone Popup UI, Massive improvement can be seen in Datapack list.\n\t\n\t\n\tEDITOR:\n\t--------\n\t\n    - Added Score Editor Tabs\n\t- Added Variable Editor Tabs\n\t- Fixed Numerous bugs within Editor functionality.\n\t-NOTE: If you plan to use Editor, and use the export button. When you open your exported JSON file, the Format will seem weird. HIGHLY ENCOURAGE You to use Notepad++ and a JSON plugin for NP++ in order to make your script look more organized and pretty. \n    \n\t\n\tFRAMEWORK:\n\t----------\n\t\n\t-Framework Updater will wait for you to retry Updating it again, if there is an issue when it extracts the new update.\n\t\n\t-Optimized Datapack loading and unloading. Refreshing is Optimized a bit more. Actions and triggers SHOULD be happening a bit more smoothly if a good amount of packs are on. \n\t\n\t-Lastly, Datapacks Now have their own cache instead of a global unique one. REASON: Donk discovered there was a 10MB limit in the whole Datapack Cache, So he split them up. Now each datapack cache created has limit of 10MB. \n\n\n\tNATIVE SETTINGS:\n\t---------------\n\n    - Settings saved and Restored. (including HUD.....Forreal, this time.)\n\t- Added Cheat Sections with some cheats :\n\t* Infinite Double Jump\n\t* Remove fall animation and damage\n\t* Change player Walk Speed (Need Save and reload)\n\t* Change player Run Speed (Need Save and reload)\n\t* Change player Sprint Speed (Need Save and reload)\n\t* Change player Jump Height  (Need Save and reload)\n\t* Change player Double Jump Height  (Need Save and reload)\n\t* Debug Menu Toggle (use at your own risk when messing with values)\n\n\tCOMPATIBLITY : \n\t--------------\n\t\n\t- For Flib's UI Improvement Mod users :\n\t\n\tif you have it, Custom shards and messages From Cyberscript will not show in Shard Menu and Messages Menu because this mod is not compatible with CyberScript. \n\tRemove it to get the custom shard and message function back.\n\n\n\n\tSCRIPT EXECUTION ENGINE (SEE):\n\t------------------------------\n    - Added in \"context\" Functionality. This is A lot to explain, So we made a page on the wiki to explain it. It's not really newbie friendly but we can further assist. Doccument is in  quest_mod\\data\\db\\ context_learning.txt <----- ALTERNATIVELY, Just go to the CyberScript Wiki and there's a sub section for Context.\n\t\n\t-Going Forward, Context is going to be Used in a wide range of things, Considering it's essentially a \"Generator\" system. So with changes you see to scores, or things becoming somthing different in framework updates. It's all for the sake of Context-use. Context is the Star of this Update. Context is Love, Context is Life.\n\t\n    - Fixed Quest Manager bug. This bug was the \"completed\" and \"Main job\" list not being able to be Collapsed. \n\t\n\t- Fixed the limit of spawned npc with prevention to 99999.\n\t\n\t- Corpo and Subcorpo's Faction are now accessible throught Script. They changes mostly every day with server event.\n\t\n    - NUMEROUS Init Fixes and Module Fixes. A lot. like, SHIT TONS Alot Alot (more than 800). Improvements to many Modules, as well as Optimization of the Modules. Further improvements will be made, in time. as we said, Big update.\n\t\n\t- You May now Have Housing Templates that you can apply to custom place and Multiplayer place. \n\t\n\t- Added a Message to the Quest Notification when the Mission starts so no confusion about Tracking the Mission Pin happens.\n\t\n\t- Fixed Ambush System and interval timer not properly working.\n\t\n\t- Added Custom Scanner Support and bounty system. \n\t\n\t- Optimize EntityManager and GroupManager\n\t\n\t- Optimized Affinity for Gang and NPC . Now there is A Score affinity. under key you will find the faction tag or the npc name.\n\t\n\t- Optimized Gang Relation and Gang District relation : Now there is a Score that have faction tag as variable and rival or district or subdistrct as key\n\t\n\t- Optimized Custom Place State and Score: Now there is a Score that have Housing Place tag as variable and \"State\" key for the state and \"Score\" key for the score (unusued)\n\t\n\n\t   \n\t\t\t\t\t\t\t\t\t\t\t||||||||||    :: 15+ New Triggers and Actions Added in this New Update ::    ||||||||||\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t -----------------------------------------------------\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t   - For your Interests, Head to || cyber_engine_tweaks\\mods\\quest_mod\\data\\db ||To Look at the triggertemplate.json and actiontemplate.json\n                                                                ------------------------------------------\n\tDATAPACKS: \n\t----------\n\t\n\t- Going Forward. The \" X-NC\" Datapacks (missions, Gangs, Life, Joyotoy of NC)  will be considered as THE Large, Expansion Packs that really Do Change up the game.\n\t\t\n\t- When We announce a new \"X-NC\" Pack, be sure it's gonna be a big change to something. \n\t\n\t- original X-NC packs like Metro, Crew, And AV will get Face Lifts as well in the comming updates. \n\t\n\t- 2 new X-NC Packs are In the planning phase....The City is More of a focus than ever with these two. <---- That was your hint for both. \n\t\n\t        \n\t--------------       ||| | | | |  | :: ALL SPAWN ISSUES FIXED :: || | | | | | (We Hope)\n\t\t\t\t\n\t-Main\n\t ----\n\t\t\t  - Added additional spawnable vehicles Factions can drive from a script. Motorcycles... yes.\n\t\t\t  - Added the remaining Citizen NPC Ids to Faction Delamain so certain scripts made are truly random. \n\t\t\t  - Added in Faction Text message threads that will only be available, based on what faction you chose to join in Gangs of Night City.\n\t\t\t  - Improved Delamain Taxi and AV timings. \n\t\t\t  \n\t- Life of Night City:\n      -----------------\n\t\n\t\t------------------------------------------------------------------------------------------------------------------\n\t\tWARNING: \n\t\tTHIS DATAPACK's \"life_manager\" EVENT WILL NOT START UNTIL YOU HAVE FINISHED THE PARADE MISSION OF THE STORY. \n\t\tITS ALSO ADVISED YOU ARE GEARED WELL FOR THE NIGHT !\n\t\t------------------------------------------------------------------------------------------------------------------\n\t\t      - Added 3600 New POIs to be used just for all the New Functions and Events made\n\t\t\t\t\t\t\t\n\t\t\t  - Added in Npcs that Walk in and out of Stores, Bars, Clubs, etc. and have a little bit of NPC chatter on them. \n\t\t\t  \n\t\t\t  - An event, called \"Life_manager\" Will select a Function. This Function is inside a larger list of Functions that will be selected randomly, 2-3 times. The entire  Timing sequence shouldn't be tampered with unless you like Chaos happening more frequently.\n\t\t\t  \n\t\t\t  - In Addition to Crowd Spawns, night time will spawn only gang members. If you are apart of a faction (Joining a gang requires to Use Gangs of Night City Datapack)  Then your faction's members will automatically be friendly Attitude towards the player. Not companion because it might cause Instability/CTD.\n\t\t\t  \n\t\t\t  - Improvements to many interact triggers have been made. \n\t\t\t  \n\t\t\t  - In regards to the \"Life_manager\", going forward with new and more complex scripts, There will always be a \"refresh\" Event now in all packs that have Event scripts. This SHOULD Greatly alleviate \"that Empty feeling\".\n\t\t\t  \n\t\t\t  - Relationships have been Improved in both Dialog, and activities. \n\t\t\t  \n\t\t\t  - We have an NPC Spawn Generator now. At this point, it's just Adding more spots to spawn them now. \n\t\t\t  \n\t\t\t  - You can help cops fulfill quota by walking up to a base game cop, use your Interact Key for the Life of Night City category and select the appropriate interact. at 30 \"Quota\" Score, you can go to regina, use an interact key that will be available at that point, and attain some new items. \n\t\t\t  \n\t\t\t  - You can help out Corpo females, in City Center, with a Hit on some Corpo man. SUPRISINGLY, These npc types do fight back. You have chances of being rewarded some good stuff.\n\t\t\t  \n\t\t\t  -There's a background story cultivating within this pack, Head to Messages and Find \"Regina CM\" to see little messages/hints on what this is about. \n\t\t\t  \n\n\t-Dangers of Night City\n\t --------------------\n\t\t\t  - Additional improvements in certain Functions. \n\t\t\t  \n\t\t\t  - Implemented the new Context System. In short terms, This allowed us to Spawn all events with infinite amount of Unique Entity Tags.\n\t\t\t  \n\t\t\t  - Made better Checks for other Datapacks that might need compatibility in some elements that are touched by both datapacks. \n\t\t\t  \n\t\t\t  -Utilizes all new POIs, in addition to the older ones. \n\n\n\t-Joytoy Of Night City\n\t -----------------\n\t\t\t  - Improved the scene with some Music, sex sounds, and a bit more logical action sequence. \n\t\t\t  \n\t\t\t  - Significantly Improved the Dialog grammar, and errors.\n\t\t\t  \n\t\t\t  - Improved spawning System of the clients\n\t\t\t  \n\n\n\t-Gangs Of Night City\n\t -----------------\n\t\t\t  - Made Reactions less annoying ish.\n\t\t\t  \n\t\t\t  - Added an interact, \"Rally\". You can only use this When You're in a gang, Life of Night City is active, and \"life_manager\" event is active. It's intended to be used \n\t\t\t  for the Gang Fights Presented in Life of Night City. \n\t\t\t  \n\t\t\t  - Big Improvements to Walk cycles, Player's Path now slightly Guides the NPCs path.... but can have discrepencies occur. Fucking... Stairs.\n\t\t\t  \n\t\t\t  - More Npcs. MOAR.\n\t\t\t  \n\t\t\t  - Significantly Improved the aesthetics of the clothing sets you get for joining a gang. \n\t\t\t  \n\t\t\t  \n\t-Reactions\n     ---------\n\t\t\t  - Added More. MOAR. Text for them to say. dialog count at 500 now.\n\t\t\t  \n\t\t\t  - Further additional changes made to be more realistic and less annoying with the frequency of npc subtitles popping up. \n\t\t\t \n\n\t-Places of Night City\n\t --------------------\n\t\t\t  - Added an event to trigger that is a \"rent\" system. You simply load the game 30 times, Each load gives a point to a \"rent\" score. Once at 30, it deducts funds. If you don't have funds, Simply lose the ownership of that place. \n\t\t\t  \n\t\t\t  - Improved the functionality of opening up a business in a business enabled place. \n\t\t\t  \n\t\t\t  \n\t-Vehicle Flying Module : \n\t --------------------\n\t\t\t- You can now buy a Flying Module that toggle flying for every vehicle. Go to your phone contact, click on \"CS : Autowerks Vehicle Service\" and an menu will open. It cost 25000€$.\n\t\t\t\n\t\t\t- this datapack replace FLY datapack\n\t\t\t\n\t\t\t- Jack's \"Let there be Flight\" Mod is an alternative route to fly your car of course. This is just a Framework specific datapack for fun. \n\t\t\t\n\t\n\t-Special Vehicle Music :\n\t ---------------------\n\t\t\t- It merge bttf, akira and bladerunner music datapack in one.\n\t\t\t\n\t\t\t- If you drive kusanagi bike, akira theme will play.\n\t\t\t\n\t\t\t- if you drive an AV, bladerunner music will play\n\t\t\t\n\t\t\t- if you drive an caliburn AV, back to the futur theme will play. Works nicer with delorean replace mod.\n\t\t\t\n\t\n\t-TraumaTeam Membership :\n\t ---------------------\n\t\t\t-Redid all the events. \n\t\t\t\n\t\t\t-Now \"TraumaSquad\" level depends of your subscription.\n\t\t\t\n\t\t\t-Membership Subscription Menu is accessible everytime, everywhere by phone contact \"CS : TraumaTeam Membership Offers\"\n\n\n\n\tRemoved datapack (outdated or useless or WIP for a redo) : \n\t----------------------------------------\n\t-akira_music\n\t-AV Music of Night CIty\n\t-bttf\n\t-FLY\n\t-Judy's Lover\n\t-French Language Datapack\n\t-German Language Datapack\n\t-Matters of gangs\n\t-Metro of Night City\n\t-Races of Night City\n\t-Russian Language Datapack\n\t-traumamember\n\t-When Cyberpsychos Attack\\n\\n1.1.17 : Fix :\\n - Fix some framework crash \\n1.1.16 : Fix :\\n Fixed Datapack Download and update  \\n1.1.15 : Fix : \\nMods : \\n -AMM API compatibility \\n- Framework Closes when the Player Tries to Update a Datapack, Or joins an Multiplayer instance then tries to join another instance. Any type of Online activity has a chance to close the framework window.\\n\\n- VIP Entities can't spawn at all, LOG: scripting.lua 2273 error points to that line. \\n\\n- The Refreshing of the Cache every time the player pauses the game , Or goes into Inventory, Makes all Gangs of Night City NPCs start to respawn Behind the player. => added an setting for disable it\\n\\n- Settings in Cybermod settings Don't save: Ambush mode, and Turn off Cybermod HUD settings do Not Save. \\n\\n- Clean the mess Action doesn't despawn an entity after looking away any more . \\n\\n- ANY ACTION That can use Current_district_leader as a string, Produces an error to identify that element.\\n\\n\\n\\nEditor :  \\n\\n-Can't Access already Made POIs anymore so The player can't load in POIs into editor.  \\n\\n- Can't Build Datapack when selecting the Tab build a datapack \\n\\n-NPC: who speak has Blank entries when using the fixer way. and only wakako shows as the option. 1.1.14\\n\\n-small fixes\\n\\n1.1.13\\n\\n-Added last killed Entity trigger and action\\n\\n1.1.12\\n\\nEditor : \\n- Path UI reworked\\n- Several Bugfix\\n- Do_function and do_random_function can now apply the targeted function to a tag. Means we can do generic function that can be reused.\\n- Do_function ,do_random_function, Do_event and do_random_event can now run the targeted script in parallel from parent script (so the parent doesn't wait the end of the execution of the script for continue)  \\n1.1.11\\nEditor : \\n- added support for free cam and industrial camera in editor setting\\n- Edited UI for path \\n- Path can now be relative\\nAn path location can now support an list of action that will play right after this location.\\n\\nActions : \\n- removeEffect_entity and applyEffect_entity changes to remove_effect and apply_effect. It now accept more effect in value.\\n- Added Set Fact\\n- Play_path and group_play_path (don't need an node to play an path !)\\n\\n\\n\\n\\nTriggers :\\n- Added check_score trigger\\n- Added last_killed_entity_is_registred trigger\\n- Added last_killed_entity_is trigger\\n- Added last_killed_entity_is_in_gang trigger\\n- Added last_killed_entity_is_in_specific_gang trigger\\n- Added last_killed_entity_gang_score trigger\\n\\n\\nFix : \\n-Phone dialog support now lang file\\n-Compiler will now handle an datapack without desc.json as an error\\n-Path is now better, faster and stronger\\n\\n\\n\\n\\nAMM Collab (Big thanks to MaximiliumM !) : \\n- Initial Support of upcoming AMM version API and specific datapack using AMM content. It will be enabled as soon that AMM release it through an small update ^^\\n- Added Songbird from AMM as Avatar for MP but also as Entity for Script (you need AMM mod for see and use her)\\n- Some datapacks will now require AMM for be seen and works. \\n- Added AMM props in Keystone Market under AMM category, you can use it in solo or MP for building (only user who have AMM will see them) :)\\n\\nThese collab means that you can use custom props and appearance from AMM. Amm props will be added on keystone market under AMM category and supported in housing (Solo or MP).\\nWe hope that this collab can unlock an lot of possibilities about stories and event ^^1.1.10 \\n + Better Datapack compiler error handling\\n+ An corrupted datapack will not be included in compiler, but the compiler will continue to check the others instead of stop all imports.\\n+ Fix bug about UI when downloading or updating an datapack will not refresh it in keystone.\\n+ Password input can now be hidden (for streaming)\\n+ Fixed an bug about init Script that doesn't run again after an save loading\\n+ Added better gang affinity calculator (in case that the save doesn't have cybermod session data bounded) \\n+ Added Recalculate All Affinity (Gang and NPC) and Clear All Affinity (Gang and NPC) in mod setting\\n- Removed Reset All Affinity (Gang and NPC) button in mod setting\\n+ Ambush doesn't take one random event anymore, it will play every possible event. The randomness must be now handled in script directly.\\n+ Fix Bug about player current gang trigger\\n+ Fix Ambush Timer and ambush trigerring\\n+ Added trigger : \\n> datapack_is_enabled\\n> datapack_version \\n 1.1.9 fix potential issue with tutorial \\n 1.1.8 - QOL fixes \\\\n1.1.7 - Rewrite dialog system (look like one in game now and clearly more organic)\\n- Better NPC invite script\\n- Optimizing Framework \\\\n 1.1.6 -Hotfix : Fix script error about clean custom mappin\\n1.1.5 - - Added Downloaded Datapack Menu in Keystone\\n- Fix scripting issue with custom place mappin on map\\n- Fix bug about AV speed doesn't show\\n- Fix Editor UI bugs (POI, Scene, Datapack Builder)\\n- Fix critical bug that break mod when using AV\\n\\n1.1.4 - remove the user disconnect at shutdown \\n1.1.3 - Better framework connection (less desync) \\n 1.1.2 - Fix HUD that doesn't disappear when toggle OFF\\n- Fix Custom Radio not playing\\n- AV have now an speed based on the real mass of the vehicule (more the vehicule is heavy, slower is the speed)\\n- AV Speed is now displayed on HUD when you are in an AV \\n- Vehicule that are undriveable can be called as AV\\n- Fix 500 and 400 framework error (it can happen but less often)\\n- Improve speed of scroll in native UI\\n- Added Scene Support in Editor and Script System :) \\n 1.1.1\\nFix :\\n-Fix issue about attitude \\n-Fix issue about modpack loading \\n1.1.0\\nFix :\\n- NPC spawned by mod can be invincible since 1.5\\n- Display custom mappin on map\\n- Gang territory doesn't show on map\\n- Lot of others bugs\\n\\nGameplay : \\n- Adapt mod to 1.5 (map, gang, apartment, code...)\\n- Improve Point Of Interest support\\n- You can buy custom place in EzEstates tab on PC, check cybermod estates menu (native support of custom place)\\n\\n\\nMultiplayer : \\n-Improved Sync between player and support vehicule skin\\n-Added player nickname display when you target one\\n-Added Mulitplayer Datapack (Joytoy RP, more to come)\\n\\n-Added Instance \\n-Added Instance User List\\n-Added Instance Management for the owner\\n-Added Instance Multiplayer Housing (you can build together !)\\n-Added RolePlay Instance \\n\\n-Added Guild\\n-Added Guild Territory System\\n-Added Guild showing on map instead of gang if online\\n\\n-Added FriendList (you can manage it)\\n-Added Phone Messages to instance\\n-Added Whisper Message (subtitle) to player\\n-Added Shootout Message (subtitle over head) to player around you\\n\\nEditor \\n- Added Editor Tutorial tabs\\n- Added JSON viewer (you can switch between Json and editor)\\n- Rework UI for Spawn NPC / Spawn Car / Set Mappin\\n- Rework some other UI components\\n- Added new items in Editor\\n- Added Housing tabs\\n- Added Editor Setting Tab (for test an script step by step and change the camera)\\n\\n\\nTechnical :\\n-New HUD\\n-Updated external psiberx library to latest version\\n-Added server score support (trigger and action)\\n-Added player server score support(trigger and action)\\n-Clean the code and optimizing it\\n-Optimize the code (thanks craze)\\n-Added Multiplayer State in native UI\\n-Added Faction Rival State in native UI\\n-Improved Spawn for NPC and vehicule\\n-Added bunch of new actions and trigger (more than 100+)\\n-New datapack loading system, faster and proper (thanks craze for the idea :) )\\n-Added Timer as native UI \\n-Added Faction Relation system, trigger and action \\n-Added Faction Relation support in Editor\\n-Added Font and Background Color Support for Interface\\n-Added Font and Background Color Support for Interface in Editor\\n-Better script logs error\\n-Added support of many notifications : Incoming Call,Quest, Shard, New Contact, Location, Activity, Hacking, Tutorial\\n-Phone notification can now load an custom Phone Thread popup where you can interact in it\\n-Shard notification can now load an custom shard popup where you can interact in it\\n-Help item is now supported in native way\\n-Added new settings for manage compiled datapack cache and UI\\n\\n\\nScript System Engine:\\n\\nNew actions : \\n-spawn_npc\\n-set_mappin\\n-spawn_vehicule_v2\\n-change_vehicle_skin\\n-incoming_call\\n-set_player_current_gang\\n-set_gang_relation\\n-add_gang_relation\\n-show_texture (support PNG, JPG, BMP image)\\n-hide_texture\\n-execute_at_script_level\\n-execute_at_script_level_group\\n-set_script_level\\n-set_script_level_group\\n-quest_notification\\n-shard_notification\\n-contact_notification\\n-location_notification\\n-activity_notification\\n-hacking_notification\\n-open_tutorial\\n-start_effect\\n-stop_effect\\n-open_help\\n\\nNew triggers : \\n-player_current_gang\\n-entity_is_in_custom_place_type\\n-entity_is_in_custom_room_type\\n-check_gang_relation\\n-texture_is_visible\\n-entity_script_level\\n-group_script_level\\n\\n\\n1.0.24\\n Fix bug about playing sound \\n1.0.23\\n Fix Login edit in Network menu 1.0.22\\n fix entrance in some custom place\\n1.0.21\\n Fix : territory point doesnt load or save. \\n Refresh when you download or update datapack \\n1.0.20 \\n Fix Native Location UI \\n 1.0.19 \\n Native Location UI (can be enable/disable in setting) \\n1.0.18 \\n Fixes :Blazing Fast Keystone Loading (5 second now) \\n - UI and Framework \\n - Added Resfresh Button everywhere :) \\n - Merry Christmas 2021 ! \\n 1.0.17 \\n Fixes : UI and Framework \\n 1.0.16 \\n Fixes : UI and Framework \\n1.0.15 \\n Fixes : UI and Framework \\n1.0.14 \\n Added some script function \\n Fix some bug in Framework \\n 1.0.12 \\n bugfix : \\n Fix gang territory affinity that are not loaded if existing sessions \\n 1.0.11 \\n bugfix : \\n native setting crash and don't save your data \\n datapack manager \\n 1.0.10 \\n :Keystone is dead, say hello to Native Keystone ! Go to any custom place that have an PC and you will find an 'CyberMod' Tab, click on it :) \\n Login is now automatic at mod launch if you have check remember me in multiplayer menu \\n Scroll work with gamepad and can be tweaked in mod setting \\n Multiplayer setting are now in mod setting \\n You can display XYZ position on Map \\n Multiplayer login and register is now in CET CM menu \\n Fix : Affinity toward entities from datapack can be enabled/disabled in setting \\n Car spawn \\n optimization"
}